{"id":37,"date":"2020-03-16T12:20:56","date_gmt":"2020-03-16T17:20:56","guid":{"rendered":"http:\/\/localhost:8888\/click5-starter\/?page_id=37"},"modified":"2021-02-10T08:54:57","modified_gmt":"2021-02-10T14:54:57","slug":"privacy-policy","status":"publish","type":"page","link":"https:\/\/www.aeroautoparts.com\/privacy-policy\/","title":{"rendered":"Privacy Policy"},"content":{"rendered":"<p>Aero Auto Parts and Frank’s Auto Glass takes the security and privacy of your personal information extremely seriously. We will not trade, sell, or rent your personally identifiable information. For an entire review of http:\/\/aeroautoparts.com privacy practices please read below.<\/p>\n<h2><strong>http:\/\/aeroautoparts.com Privacy Policy<\/strong><\/h2>\n<p>We are strongly devoted to defending the privacy of your personal information. The policies underneath are relevant to the http:\/\/aeroautoparts.com website (“Website”) created and sustained by Aero Auto Parts and Frank’s Auto Glass (collectively “Aero Auto Parts and Frank’s Auto Glass” or “we”, “us”, or “our”). We have established this security and privacy policy (“Privacy Policy”) to inform you of the type of personal information we may collect throughout your visit to the Website, why we collect your information, what we use your personal information for, when we may provide your personal information, and how you can control your personal information.<\/p>\n<p>Please understand that the practices expressed in this Privacy Policy are only applicable to information collected from this Web Site and, where relevant, from this Web Site’s Customer Service Department in association with this Web Site, and do not unconsciously reflect our practices with approval to information collected from other Web sites that we manage or through other off-line means.<\/p>\n<p>By visiting our Website, you are complying with the practices expressed in our Privacy Policy. If you do not concur to the terms of this Privacy Policy, please do not use the Website. We may, from time to time, revise this privacy policy, and the date of last revision will be available at the bottom of this page. By using the Services, you are acknowledging and accepting this Privacy Policy. Your continued use of the Services after changes have been posted to the Privacy Policy will constitute your acceptance of such changes.<\/p>\n<p>If you have any inquiries about this Privacy Policy or do not see your concerns addressed here, you ought to contact us by email at franksautoglass@sbcglobal.net .<\/p>\n<h2>What Information About Me Is Collected and Stored?<\/h2>\n<p>Aero Auto Parts and Frank’s Auto Glass adheres to the uppermost standards of ethical practices in all of our processes and is devoted to protecting the privacy of all users of our Website. Our privacy policy is straightforward: Except as revealed below, we don’t sell, barter, deliver, or rent your personal information to any organization or individual external of Aero Auto Parts and Frank’s Auto Glass. One of the essential values we’ve tried to follow in the creation of this Website is that we inquire for no more than the necessary information required to provide the service(s) you’ve asked for. As a result, what information we collect and store depends more or less completely on how you decide to make use of our Website and our services.<\/p>\n<h2>Personal Information<\/h2>\n<p>We accumulate and store information that you enter into this Web Site or that you supply through our Customer Service Department. For instance, when you create an account or place an order, we accumulate and store some or all of the subsequent information that you supply: name, billing address, shipping address, email address, telephone number, and credit card number and expiration date. This information is used to make available the products and services that you have ordered or requested, to process and ship orders, to mail order and shipping confirmations and to supply customer service. Registration can also be mandatory and Personal Information could also be gathered in certain segments of the Website in which you purposely and intentionally supply such information, e.g. community postings (i.e., chat or bulletin boards), propositions, or customer service requirements. Parts of this information also could be used to get in touch with you about sales, new products, special offers, and new site features, unless you have opted to not obtain promotional interactions in association with this Web Site.<\/p>\n<h2>Anonymous Information<\/h2>\n<p>During your use of the Website, we may possibly collect certain information that does not recognize you independently (“Anonymous Information”). Usually, this information is gathered from “traffic data”. We accumulate and store certain other information repeatedly whenever you interact with this Web Site. For instance, we collect your IP address, browser information and reference site domain name each time you are on this Web Site. We also gather information as regards customer traffic patterns and site usage. This information is used to examine and advance this Website and to give our clientele a gratifying online experience.<\/p>\n<h2>Use of Cookies and Spyware<\/h2>\n<p>We in no way apply or install spyware on your computer, nor do we utilize spyware to recover information from your computer.<\/p>\n<p>In addition, like several Websites, we apply “cookies”, which are records stored on your computer’s hard drive by your browser. Cookies allow us to recognize account owners and to optimize their shopping experience. Cookies also permit us to hold assortments in a shopping cart when a customer departs this Web Site without inspection. The majority of browsers recognizes cookies by design, but allows you to stop them. We advise that you keep cookies “turned on” so that we are able to provide you a user friendly online experience on this Website. You can occasionally get Cookies from companies marketing on our behalf. We do not manage these Cookies, and these Cookies are not subject to our Cookie policy.<\/p>\n<p>We also might gather and accumulate information about you that we obtain from others, to allow us to revise and provide accurate information enclosed in our database and to give product counsel and special offers that we believe will be of importance to you, if you have decided to accept e-mail from us, and provide you reminders about shopping opportunities.<\/p>\n<h2>Newsletters<\/h2>\n<p>We gather e-mail addresses and zip codes of all consumers who subscribe to our newsletter. Not including to our third party representatives (as explained below), this information is not publicized with any third parties for any reasons. Any person who does not want to obtain this newsletter can, at any time, follow the “Unsubscribe” directions contained in every newsletter.<\/p>\n<h2>Is Information Collected From Children?<\/h2>\n<p>We do not sell or ship anything ordered from this Web Site directly to anyone who we know to be under the age of 13, nor do we collect any personal information from a person who we identify to be under 13 years old. If you are under the age of 13, you ought to utilize this Web Site only with the participation of a parent or guardian and must not surrender any personal information to us. Our Website is not purposely targeted to children under the age of 13. Children under the age of 13 must not use our Website without attaining prior parental permission.<\/p>\n<h2>How We Use Your Information?<\/h2>\n<p>Apart from what is revealed in this Security and Privacy Policy, we do not utilize or release information about your personal usage on our Website or your Personal Information received online to anyone or any organization not associated with us. If we recommend authorizing any use of your Personal In formation, you will be given the chance to tell us not to permit such contact.<\/p>\n<h2>Customer Service and Feedback<\/h2>\n<p>We might use your Personal Information to complete orders, offer customer service, track your fulfillment with the Website’s rules and regulations, or for perspective and criticism reasons (to the degree that is elucidated when you supply the information). In the occasion we prepare to openly post any of your Personal Information on a Website (as, for instance, a letter), you will be given advanced notice of such redistribution and provided the opportunity of stopping such redistributions.<\/p>\n<h2>Use of Anonymous Information<\/h2>\n<p>We make use of Anonymous Information to assist us distinguish how user make use of sections of the Website and who our users are so we can enhance our Website and make certain that it is as pleasing as we can build it for the masses. We might also utilize or distribute Anonymous Information (or additional information, other than Personal Information) in some other method that we consider suitable or essential.<\/p>\n<h2>Third-party Agents<\/h2>\n<p>We intermittently have third party representatives, subsidiaries, affiliates and partners that execute functions for us, such as advertising, analytics, credit card processing, shipping or stocking information, only if customer service, fraud protection etc (for example, Cheetahmail aids with advertising and GSI Commerce aids with customer service). These units have right of entry to the Personal Information required to execute their occupations and are contractually obliged to preserve the privacy and protection of that Personal Information. They are constrained from using, selling, allocating or modifying this information in any way other than to supply the requested services to the Website.<\/p>\n<h2>Transactional partners<\/h2>\n<p>We might distribute non-personal information with our associates and others from time to time. Instances of such non-personal information comprise of the amount of customers who came to this Web Site during a definite time period or obtained a certain product from this Web Site. This information, in general, is shared in a collective form.<\/p>\n<h2>Emergency Situations<\/h2>\n<p>We may also use or disclose Personal Information if required to do so by law or in the good-faith belief that such action is necessary to (a) conform to applicable law or comply with legal process served on us or the Website; (b) protect and defend the our rights or property, the Website or our users, and (c) act under emergency circumstances to protect the personal safety of us, our affiliates, agents, or the users of the Website or the public.<\/p>\n<h2>What Happens When I Link To or From Another Web Site?<\/h2>\n<p>This Web Site might include links to other Websites managed by Company, partners of Company or third parties. Please understand that the practices expressed in this Privacy Policy for http:\/\/aeroautoparts.com and Aero Auto Parts and Frank’s Auto Glass do not apply to information collected from these other Websites. These other online locations could also provide their own cookies to you and gather your data or request your personal information. Constantly be conscious of where you end up. We are not accountable for the actions and privacy policies of third parties and other websites. We want you to be sure you are aware of when you depart this Website and to proactively read the privacy policies of all Websites that you enter in to.<\/p>\n<h2>What About Contests and Sweepstakes?<\/h2>\n<p>When a contest or sweepstakes is promoted and is associated with this Web Site, it will come with set of regulations. The regulations for each contest\/sweepstakes will state how the information provided by will be applied and released, and if it is unlike that expressed in this Privacy Policy. Personal Information will be gathered only if you willingly offer it to our sponsors or us.<\/p>\n<h2>Public Areas, Chat Rooms and Newsgroups<\/h2>\n<p>Keep in mind that any information you provide in communal areas, such as message boards or feedback segments, are converted into public information, and therefore this Privacy Policy does not relate to any information you choose to make public. Please be wary about what you provide and do not post any Personal Information that you intend to be confidential.<\/p>\n<h2>Governing Law\/Assignment<\/h2>\n<p>The http:\/\/aeroautoparts.com website is published in the United States and is planned for users from the United States. U.S. law shall administer in any and all disagreements, together with privacy or offense matters or otherwise.<\/p>\n<p>We might modify its possession or business association while supplying the website and services. As a consequence, please be sensitive to the case that we may possibly move your information to a different organization that is associated with us or with which we have made a joint venture with. Under such conditions Company would to the degree probable involve the acquiring party to pursue the practices explained in this Privacy Policy, as it could be revised from time to time.<\/p>\n<h2>Changes to This Policy<\/h2>\n<p>We are dedicated to sustaining its place as a high quality Website on the World Wide Web. As our Website keeps developing, we possibly will add new services and features to our Website. In the occasion that these added extras influence our Privacy Policy; this manuscript will be revised aptly. We will place those revisions significantly so that you will constantly identify what information we collect, how we could apply that information and whether we will reveal it. We do, nonetheless, suggest that you read this Privacy Policy every time you visit our website in case you overlook our notice of amendments to the Privacy Policy.<\/p>\n<h2>Opt-Out and Correction Procedures<\/h2>\n<p>You can at any time opt-out of getting potential e-mails and newsletters. We offer you with the option to opt-out of getting communications from us at the point where we ask for information concerning you. There are a variety of ways in which you can inform us whether or not you want to accept promotional communications from http:\/\/aeroautoparts.com. When you initiate an account, or place an order, you will have an opportunity to make your selections in this regard. You also will have an opportunity to change these selections by following the “unsubscribe” instructions contained in the promotional emails we send you.<\/p>\n<h3>Who do I talk to if I have more questions?<\/h3>\n<p>Questions regarding this statement should be directed to the http:\/\/aeroautoparts.com Customer Service; or send an email to franksautoglass@sbcglobal.net .<\/p>\n<p>Last Updated: 08\/05\/2013<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Aero Auto Parts and Frank’s Auto Glass takes the security and privacy of your personal information extremely seriously. We will not trade, sell, or rent your personally identifiable information. For an entire review of http:\/\/aeroautoparts.com privacy practices please read below. http:\/\/aeroautoparts.com Privacy Policy We are strongly devoted to defending the privacy of your personal information. [&#8230;]<\/p>\n<p><a class=\"btn btn-outline-secondary click5-read-more-link\" href=\"https:\/\/www.aeroautoparts.com\/privacy-policy\/\">Read More&#8230;<\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"_acf_changed":false,"footnotes":""},"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v22.0 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Privacy Policy | Aero Auto Parts<\/title>\n<meta name=\"description\" content=\"Aero Auto Parts takes the security and privacy of your personal information extremely seriously. We will not trade, sell or rent your identifiable information.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.aeroautoparts.com\/privacy-policy\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Privacy Policy | Aero Auto Parts\" \/>\n<meta property=\"og:description\" content=\"Aero Auto Parts takes the security and privacy of your personal information extremely seriously. We will not trade, sell or rent your identifiable information.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.aeroautoparts.com\/privacy-policy\/\" \/>\n<meta property=\"og:site_name\" content=\"Aero Auto Parts\" \/>\n<meta property=\"article:modified_time\" content=\"2021-02-10T14:54:57+00:00\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"10 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.aeroautoparts.com\/privacy-policy\/\",\"url\":\"https:\/\/www.aeroautoparts.com\/privacy-policy\/\",\"name\":\"Privacy Policy | Aero Auto Parts\",\"isPartOf\":{\"@id\":\"https:\/\/www.aeroautoparts.com\/#website\"},\"datePublished\":\"2020-03-16T17:20:56+00:00\",\"dateModified\":\"2021-02-10T14:54:57+00:00\",\"description\":\"Aero Auto Parts takes the security and privacy of your personal information extremely seriously. We will not trade, sell or rent your identifiable information.\",\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.aeroautoparts.com\/privacy-policy\/\"]}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.aeroautoparts.com\/#website\",\"url\":\"https:\/\/www.aeroautoparts.com\/\",\"name\":\"Aero Auto Parts\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.aeroautoparts.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Privacy Policy | Aero Auto Parts","description":"Aero Auto Parts takes the security and privacy of your personal information extremely seriously. We will not trade, sell or rent your identifiable information.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.aeroautoparts.com\/privacy-policy\/","og_locale":"en_US","og_type":"article","og_title":"Privacy Policy | Aero Auto Parts","og_description":"Aero Auto Parts takes the security and privacy of your personal information extremely seriously. We will not trade, sell or rent your identifiable information.","og_url":"https:\/\/www.aeroautoparts.com\/privacy-policy\/","og_site_name":"Aero Auto Parts","article_modified_time":"2021-02-10T14:54:57+00:00","twitter_card":"summary_large_image","twitter_misc":{"Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/www.aeroautoparts.com\/privacy-policy\/","url":"https:\/\/www.aeroautoparts.com\/privacy-policy\/","name":"Privacy Policy | Aero Auto Parts","isPartOf":{"@id":"https:\/\/www.aeroautoparts.com\/#website"},"datePublished":"2020-03-16T17:20:56+00:00","dateModified":"2021-02-10T14:54:57+00:00","description":"Aero Auto Parts takes the security and privacy of your personal information extremely seriously. We will not trade, sell or rent your identifiable information.","inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.aeroautoparts.com\/privacy-policy\/"]}]},{"@type":"WebSite","@id":"https:\/\/www.aeroautoparts.com\/#website","url":"https:\/\/www.aeroautoparts.com\/","name":"Aero Auto Parts","description":"","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.aeroautoparts.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"}]}},"_links":{"self":[{"href":"https:\/\/www.aeroautoparts.com\/wp-json\/wp\/v2\/pages\/37"}],"collection":[{"href":"https:\/\/www.aeroautoparts.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.aeroautoparts.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.aeroautoparts.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.aeroautoparts.com\/wp-json\/wp\/v2\/comments?post=37"}],"version-history":[{"count":0,"href":"https:\/\/www.aeroautoparts.com\/wp-json\/wp\/v2\/pages\/37\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.aeroautoparts.com\/wp-json\/wp\/v2\/media?parent=37"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}